app/views/lessons/show.html.erb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."lesson_id" = $1  [["lesson_id", 1]]
---
    <% if @lesson.capacity %>
      <li id="lesson-availability" data-avail="<%= @lesson.capacity-@lesson.bookings.length %>">Availability: <%= @lesson.capacity-@lesson.bookings.length %></li>