app/controllers/bookings_controller.rb

INSERT INTO "bookings" ("user_id", "lesson_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["lesson_id", 1], ["status", "pending"], ["created_at", "2015-03-02 23:46:30.302947"], ["updated_at", "2015-03-02 23:46:30.302947"]]
---
  def create
    @booking = Booking.create(booking_params)