app/controllers/lessons_controller.rb

  def show
    @lesson = Lesson.find(params[:id])
    @user = current_user
    @booking = @user.bookings.where(lesson_id: @lesson.id)
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."lesson_id" = $1  [["lesson_id", 1]]

  def new
    @lesson = Lesson.new
    @categories = Category.all
---
SELECT "categories".* FROM "categories"