app/controllers/reviews_controller.rb

SELECT "lessons".* FROM "lessons"
---
  def new
    @review = Review.new
    @lessons = Lesson.all

INSERT INTO "reviews" ("rating", "comment", "lesson_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["rating", 4], ["comment", "I love streetdancing"], ["lesson_id", 17], ["created_at", "2015-03-03 14:56:35.643322"], ["updated_at", "2015-03-03 14:56:35.643322"]]
UPDATE "reviews" SET "user_id" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["user_id", 1], ["updated_at", "2015-03-03 14:49:53.693136"], ["id", 7]]
---
  def create
    @review = Review.create(review_params)
    @review.user_id = current_user.id
    @review.save