app/views/reviews/_form.html.erb

SELECT "lessons".* FROM "lessons"
---
  <div class="field">
    <%=f.collection_select :lesson_id, Lesson.all, :id, :title  %>